
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
google_pubsub_topic_iam_member.gmail_member["Council Data DVR"]: Refreshing state... [id=projects/rising-sector-360922/topics/council_data_dvr/roles/pubsub.publisher/serviceAccount:gmail-api-push@system.gserviceaccount.com]
google_pubsub_topic.label_topics["Council Data Sales"]: Refreshing state... [id=projects/rising-sector-360922/topics/council_data_sales]
google_service_account.cloud_run_sa: Refreshing state... [id=projects/rising-sector-360922/serviceAccounts/gmail-watcher@rising-sector-360922.iam.gserviceaccount.com]
google_service_account.cloud_run_scheduler: Refreshing state... [id=projects/rising-sector-360922/serviceAccounts/scheduler@rising-sector-360922.iam.gserviceaccount.com]
google_pubsub_topic.label_topics["Council Data DVR"]: Refreshing state... [id=projects/rising-sector-360922/topics/council_data_dvr]
data.google_project.project: Reading...
google_pubsub_topic_iam_member.gmail_member["Council Data Sales"]: Refreshing state... [id=projects/rising-sector-360922/topics/council_data_sales/roles/pubsub.publisher/serviceAccount:gmail-api-push@system.gserviceaccount.com]
google_project_iam_member.datastore_user: Refreshing state... [id=rising-sector-360922/roles/datastore.user/serviceAccount:gmail-watcher@rising-sector-360922.iam.gserviceaccount.com]
google_cloud_run_v2_job.gmail_watcher: Refreshing state... [id=projects/rising-sector-360922/locations/us-central1/jobs/gmail-watcher]
data.google_project.project: Read complete after 1s [id=projects/rising-sector-360922]
google_cloud_run_v2_job_iam_member.cloud_run_invoker_member: Refreshing state... [id=projects/rising-sector-360922/locations/us-central1/jobs/gmail-watcher/roles/run.invoker/serviceAccount:scheduler@rising-sector-360922.iam.gserviceaccount.com]
google_cloud_scheduler_job.trigger_job: Refreshing state... [id=projects/rising-sector-360922/locations/us-central1/jobs/schedule-gmail-watcher]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # google_cloud_run_v2_job.gmail_watcher will be updated in-place
  ~ resource "google_cloud_run_v2_job" "gmail_watcher" {
        id                       = "projects/rising-sector-360922/locations/us-central1/jobs/gmail-watcher"
        name                     = "gmail-watcher"
        # (13 unchanged attributes hidden)

      ~ template {
            # (3 unchanged attributes hidden)

          ~ template {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "us-central1-docker.pkg.dev/rising-sector-360922/artifact-registry/gmail-watcher:716583423d8c5b633a496c42f2862ec98f7dbad9" -> "us-central1-docker.pkg.dev/rising-sector-360922/artifact-registry/gmail-watcher:5dd614aa459468b4805781c3eec6c25975083ad2"
                    # (2 unchanged attributes hidden)

                  ~ env {
                      ~ name  = "labels_to_watch" -> "labels_to_process"
                      ~ value = "council_data_dvr,projects/rising-sector-360922/topics/council_data_dvr,council_data_sales,projects/rising-sector-360922/topics/council_data_sales" -> "council_data_dvr,council_data_dvr,council_data_sales,council_data_sales"
                    }

                    # (2 unchanged blocks hidden)
                }
            }
        }
    }

  # google_pubsub_topic.label_topics["Council Data DVR"] will be destroyed
  # (because google_pubsub_topic.label_topics is not in configuration)
  - resource "google_pubsub_topic" "label_topics" {
      - id                         = "projects/rising-sector-360922/topics/council_data_dvr" -> null
      - labels                     = {} -> null
      - message_retention_duration = "86600s" -> null
      - name                       = "council_data_dvr" -> null
      - project                    = "rising-sector-360922" -> null
    }

  # google_pubsub_topic.label_topics["Council Data Sales"] will be destroyed
  # (because google_pubsub_topic.label_topics is not in configuration)
  - resource "google_pubsub_topic" "label_topics" {
      - id                         = "projects/rising-sector-360922/topics/council_data_sales" -> null
      - labels                     = {} -> null
      - message_retention_duration = "86600s" -> null
      - name                       = "council_data_sales" -> null
      - project                    = "rising-sector-360922" -> null
    }

  # google_pubsub_topic_iam_member.gmail_member["Council Data DVR"] will be destroyed
  # (because google_pubsub_topic_iam_member.gmail_member is not in configuration)
  - resource "google_pubsub_topic_iam_member" "gmail_member" {
      - etag    = "BwYCJkPy+xA=" -> null
      - id      = "projects/rising-sector-360922/topics/council_data_dvr/roles/pubsub.publisher/serviceAccount:gmail-api-push@system.gserviceaccount.com" -> null
      - member  = "serviceAccount:gmail-api-push@system.gserviceaccount.com" -> null
      - project = "rising-sector-360922" -> null
      - role    = "roles/pubsub.publisher" -> null
      - topic   = "projects/rising-sector-360922/topics/council_data_dvr" -> null
    }

  # google_pubsub_topic_iam_member.gmail_member["Council Data Sales"] will be destroyed
  # (because google_pubsub_topic_iam_member.gmail_member is not in configuration)
  - resource "google_pubsub_topic_iam_member" "gmail_member" {
      - etag    = "BwYCJkPy84U=" -> null
      - id      = "projects/rising-sector-360922/topics/council_data_sales/roles/pubsub.publisher/serviceAccount:gmail-api-push@system.gserviceaccount.com" -> null
      - member  = "serviceAccount:gmail-api-push@system.gserviceaccount.com" -> null
      - project = "rising-sector-360922" -> null
      - role    = "roles/pubsub.publisher" -> null
      - topic   = "projects/rising-sector-360922/topics/council_data_sales" -> null
    }

  # google_storage_bucket.file_bucket["Council Data DVR"] will be created
  + resource "google_storage_bucket" "file_bucket" {
      + force_destroy               = true
      + id                          = (known after apply)
      + labels                      = (known after apply)
      + location                    = "US-CENTRAL1"
      + name                        = "council_data_dvr"
      + project                     = "rising-sector-360922"
      + public_access_prevention    = "enforced"
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)
    }

  # google_storage_bucket.file_bucket["Council Data Sales"] will be created
  + resource "google_storage_bucket" "file_bucket" {
      + force_destroy               = true
      + id                          = (known after apply)
      + labels                      = (known after apply)
      + location                    = "US-CENTRAL1"
      + name                        = "council_data_sales"
      + project                     = "rising-sector-360922"
      + public_access_prevention    = "enforced"
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)
    }

  # google_storage_bucket_iam_member.storage_member["Council Data DVR"] will be created
  + resource "google_storage_bucket_iam_member" "storage_member" {
      + bucket = (known after apply)
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "serviceAccount:gmail-watcher@rising-sector-360922.iam.gserviceaccount.com"
      + role   = "roles/storage.admin"
    }

  # google_storage_bucket_iam_member.storage_member["Council Data Sales"] will be created
  + resource "google_storage_bucket_iam_member" "storage_member" {
      + bucket = (known after apply)
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "serviceAccount:gmail-watcher@rising-sector-360922.iam.gserviceaccount.com"
      + role   = "roles/storage.admin"
    }

Plan: 4 to add, 1 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @Wallace99, Action: `pull_request`, Working Directory: `./terraform`, Workflow: `Deploy`*